Tutorial/20221229193155-fix_aspell_on_nixos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Fix Aspell on nixos</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">Fix Aspell on nixos</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5fcc8f4">How to fix aspell on nixos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class=""></span>&#xa0;<span class="nixos">nixos</span></span></a>
<ul>
<li><a href="#org087f519">Steps to fix it</a>
<ul>
<li><a href="#orga790cad">systemwide</a></li>
<li><a href="#org4809aa7">home-manager</a></li>
<li><a href="#org36930ac">Fix not being able to save a personal word</a></li>
<li><a href="#org5bad80e">Emacs setup</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org5fcc8f4" class="outline-2">
<h2 id="org5fcc8f4">How to fix aspell on nixos&#xa0;&#xa0;&#xa0;<span class="tag"><span class="emacs">emacs</span>&#xa0;<span class=""></span>&#xa0;<span class="nixos">nixos</span></span></h2>
<div class="outline-text-2" id="text-org5fcc8f4">
<p>
I was trying to use aspell for spell checking on nixos with emacs and i could not get it to find the path to the apsell.
</p>
</div>

<div id="outline-container-org087f519" class="outline-3">
<h3 id="org087f519">Steps to fix it</h3>
<div class="outline-text-3" id="text-org087f519">
<p>
These steps should fix it.
</p>
</div>
<div id="outline-container-orga790cad" class="outline-4">
<h4 id="orga790cad">systemwide</h4>
<div class="outline-text-4" id="text-orga790cad">
<p>
include in your system packages.
</p>
<div class="org-src-container">
<pre class="src src-nix">environment.systemPackages = with pkgs; [
    aspell
    aspellDicts.en
]
</pre>
</div>
</div>
</div>
<div id="outline-container-org4809aa7" class="outline-4">
<h4 id="org4809aa7">home-manager</h4>
<div class="outline-text-4" id="text-org4809aa7">
<div class="org-src-container">
<pre class="src src-nix"># ~/.config/nixpkgs/home.nix
{ config, pkgs, ... }:
{
  # ..
  home.packages = with pkgs; [
    # ..
    aspell
    aspellDicts.en
  ];

  home.file.".aspell.conf".text = "data-dir ${pkgs.aspell}/lib/aspell";
  # ..
}
</pre>
</div>
</div>
</div>


<div id="outline-container-org36930ac" class="outline-4">
<h4 id="org36930ac">Fix not being able to save a personal word</h4>
<div class="outline-text-4" id="text-org36930ac">
<p>
create a pws and setq it
</p>
<div class="org-src-container">
<pre class="src src-shell">mkdir -p ~/.emacs.d/.local/etc/ispell &amp;&amp; touch ~/.emacs.d/.local/etc/ispell/.pws
</pre>
</div>
<p>
Be sure that the file is in aspells personal word dictionary format!
basically just include this at the top of the pws file.
</p>
<pre class="example" id="orgaca4ad6">
personal_ws-1.1 en 1 utf-8
</pre>
</div>
</div>

<div id="outline-container-org5bad80e" class="outline-4">
<h4 id="org5bad80e">Emacs setup</h4>
<div class="outline-text-4" id="text-org5bad80e">
<p>
The following is from my emacs config
Make sure its using aspell
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> ispell-program-name <span style="font-style: italic;">"aspell"</span>)
</pre>
</div>
<p>
Set dictionary
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> ispell-dictionary <span style="font-style: italic;">"en"</span>)
</pre>
</div>

<p>
Set personal dictionary
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq</span> ispell-personal-dictionary <span style="font-style: italic;">"~/.aspell.en_us.pws"</span>)
</pre>
</div>

<p>
Spell fu setup
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(add-hook 'spell-fu-mode-hook
  (<span style="font-weight: bold;">lambda</span> ()
    (spell-fu-dictionary-add (spell-fu-get-ispell-dictionary <span style="font-style: italic;">"en"</span>))
    (spell-fu-dictionary-add
      (spell-fu-get-personal-dictionary <span style="font-style: italic;">"en-personal"</span> <span style="font-style: italic;">"~/.aspell.en_us.pws"</span>))))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
